{
    "workshops": [
        {
            "key": "elasticsearch",
            "active": true,
            "title": "Getting started with Elasticsearch",
            "topics": "Elasticsearch",
            "instructor_name": "Ganesh Swami",
            "instructor_first_name": "Ganesh",
            "slot": "half-day-am",
            "abstract": "<p>This tutorial is an Elasticsearch bootcamp. Elasticsearch is a distributed and scalable search server based on Apache Lucene. You can use Elasticsearch to power your search and analytics in your applications. At the end of the day, you&rsquo;ll:</p>\n\n<p>1. know the most important concepts and terminology of search engines<br />\n2. have a deep understanding of Elasticsearch<br />\n3. apply Elasticsearch to build search applications<br />\n4. analyze and resolve common problems with Elasticsearch</p>\n\n<p>No prior experience with search or Elasticsearch is required. <br />\n</p>",
            "instructor_bio": "<p>10+ years of professional programming experience.</p>\n\n<p>Relevant background: I run a hosted Elasticsearch company silota.com, so I'm familiar with most build and operational aspects of ES.</p>\n\n<p>My most <a href=\"http://www.slideshare.net/silota/building-restful-apis\">recent talk</a> on building APIs at Vancouver Python Day was well received:</p>\n\n<p>I like the challenge of taking complex topics and explaining them to a beginner.<br />\n</p>",
            "syllabus_url" : ""
        },
        {
            "key": "testable-software",
            "active": true,
            "title": "Writing Testable Software",
            "topics": "Testing",
            "instructor_name" : "Clifford Hammerschmidt",
            "instructor_first_name" : "Clifford",
            "slot": "half-day-pm",
            "abstract": "<p>We all know we should test the software we write, and yet many of us still write software that is difficult to test. In this tutorial we'll work through refactoring software to be easier to test and walk through examples of code written with testing in mind. Bring a laptop with either JDK 1.7 or Visual Studio (with C#) installed and expect to write code and tests.</p>",
            "instructor_bio" : "<p>Clifford Hammerschmidt is a software architect with over twenty years experience architecting and writing software. He currently works for Amazon and organizes the Vancouver Software Developers Meetup (<a href=\"http://vandev.org\">vandev.org</a>). He has worked on business applications, anti-spam systems, games, low level concurrency libraries, and high volume application apis handling thousands of requests a second.</p>",
            "syllabus_url" : ""
        },
        {
            "key": "golang",
            "active": false,
            "title": "Go Bootcamp",
            "topics": "Go",
            "instructor_name" : "Kamil Kisiel",
            "instructor_first_name" : "Kamil",
            "slot": "full-day",
            "abstract": "",
            "instructor_bio" : "",
            "syllabus_url" : ""
        },
        {
            "key": "reactjs",
            "active": true,
            "title": "Welcome to ReactJS",
            "topics": "Javascript",
            "instructor_name" : "Steven Luscher",
            "instructor_first_name" : "Steven",
            "slot": "full-day",
            "abstract": "<p>React is a Javascript library for building user interfaces that challenges some fundamental assumptions about how user interfaces should be built. In this workshop, you will learn to &quot;think in React,&quot; as you build an interactive, data-driven, client-server web application in the browser.</p>\n\n<p>First, we will learn what's distinctive about the React approach, and how we can benefit from it. Next, we will learn how React components are built, how they operate, how they communicate with each other, and how to test them. Along the way, in pairs or small groups, we will laugh, cry, scream, and cheer, but ultimately build some working software, the React Way.</p>",
            "instructor_bio" : "<p>Steven Luscher builds web and mobile applications using HTML, CSS, Javascript, Ruby, and Objective-C. En-route to becoming a polyglot coder, he made stops along the way to pursue formal education in graphic design, mathematics, and pedagogy; experiences which have served him well in the area of web application development.</p>\n\n<p>In 2013, he delivered a <a href=\"https://github.com/steveluscher/react-supervanjs-2013\">conference talk</a> about React at Super VanJS. He currently works full-time developing a mammoth React-based application using Coffeescript, JSX, Node, and MongoDB.</p>\n\n<p>He does not work for Facebook.</p>",
            "syllabus_url" : "https://github.com/steveluscher/react-polyglot-conf-2014",
            "twitter_handle" : "@steveluscher"
        },
        {
            "key": "docker",
            "active": true,
            "title": "Docker in Depth",
            "topics": "Docker",
            "instructor_name" : "Tavis Rudd",
            "instructor_first_name" : "Tavis",
            "slot": "full-day",
            "abstract": "<p>A full day hands-on dive into docker.</p>",
            "instructor_bio" : "",
            "syllabus_url" : ""
        },
        {
            "key": "scala-web",
            "active": true,
            "title": "Building a Truly Modern Web App/API with Scala and Akka",
            "topics": "Scala, Akka",
            "instructor_name" : "Alex Cruise",
            "instructor_first_name" : "Alex",
            "slot": "full-day",
            "abstract": "<p>Web apps and APIs are hugely important parts of modern life, but in many cases, the way they're built hasn't changed in many years. These older tools make scale-out hard, and the resulting systems don't always handle failures gracefully. </p>\n\n<p>Let's take a deep dive into a technology stack that is designed from the ground up for productivity, scalability, correctness and fault tolerance, and see how much can be achieved with surprisingly little code.</p>",
            "instructor_bio" : "<p>I've been building software for a disturbingly long time, and felt like I knew what I was doing until I met Scala and realized how much of the world of computer science I'd been missing.</p>\n\n<p>Over the past four years, I've used Scala for all my serious development work, and have accumulated a tiny bit of wisdom and a lot of humility to go with my battle scars and war stories.</p>",
            "syllabus_url" : ""
        },
        {
            "key": "haskell",
            "active": true,
            "title": "Real World Programming With Haskell",
            "topics": "Haskell",
            "instructor_name" : "Roman Gonzalez",
            "instructor_first_name" : "Roman",
            "slot": "full-day",
            "abstract": "<p>Participants will tip their toes into the functional programming mindset using Haskell. This is described by many as a mind-bending experience and a challenging one, covering many concepts of the functional paradigm like persistent data structures, tail-recursion, Functors, Monads etc. </p>\n\n<p>We'll explore the lazy behavior of the language, and also how to make functions pure (e.g. enforce avoidance of unintended side effects).</p>\n\n<p>We are going to learn the different tools that Haskell provide for concurrent programming, from Software Transactional Memory, to basic mutable variables.</p>\n\n<p>We are going to learn the basics of Parser Combinators, and we will finish it up with the implementation of a very basic Web app using Scotty, an easy to use Web Framework.</p>",
            "instructor_bio" : "<p>Roman Gonzalez is one of the co-founder of Birdseye Software, he has done many consultancy jobs in the past using Ruby on Rails, and has lead the development team of a local Startup, he has participated in many open source projects using Ruby, Clojure, elisp and Haskell. </p>\n\n<p>He has been using Haskell for the past 6 years, and has given many tutorials on the Vancouver's Haskell Meetup where he is one of the main organizers. He also has given presentations in the Polyglot Meetup and ClojureWest 2013.</p>",
            "syllabus_url" : ""
        },
        {
            "key": "bdd",
            "active": false,
            "title": "Behaviour Driven Development",
            "topics": "BDD",
            "instructor_name" : "Martin Suchanek",
            "instructor_first_name" : "Martin",
            "slot": "half-day-pm",
            "abstract": "",
            "instructor_bio" : "",
            "syllabus_url" : ""
        },
        {
            "key": "ios-ui",
            "active": false,
            "title": "Auto Layout and Storyboards on iOS",
            "topics": "iOS",
            "instructor_name" : "Allen Pike",
            "instructor_first_name" : "Allen",
            "slot": "full-day",
            "abstract": "",
            "instructor_bio" : "",
            "syllabus_url" : ""
        },
        {
            "key": "emberjs",
            "active": false,
            "title": "Intro to EmberJS",
            "topics": "Javascript, EmberJS",
            "instructor_name" : "Dave Laird",
            "instructor_first_name" : "Dave",
            "slot": "half-day-am",
            "abstract": "",
            "instructor_bio" : "",
            "syllabus_url" : ""
        },
        {
            "key": "containers",
            "active": false,
            "title": "Containers and PaaS: Revolutionizing Cloud Application Development",
            "topics": "Containers, PaaS, Cloud application development",
            "instructor_name" : "John Wetherill",
            "instructor_first_name" : "John",
            "slot": "full-day",
            "abstract": "",
            "instructor_bio" : "",
            "syllabus_url" : ""
        }
    ]
}
